TexasInstruments/mspm0-sdk/examples/nortos/CUSTOM_BOARD/driverlib/empty_mspm0l1227/empty_mspm0l1227.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 */
//@cliArgs --device "MSPM0L122X" --package "LQFP-80(PN)" --part "Default"
//@v2CliArgs --device "MSPM0L1227" --package "LQFP-80(PN)"

/**
 * Import the modules used in this configuration.
 */
const SYSCTL = scripting.addModule("/ti/driverlib/SYSCTL");
const ProjectConfig = scripting.addModule("/ti/project_config/ProjectConfig");

/**
 * Write custom configuration values to the imported modules.
 */

const Board = scripting.addModule("/ti/driverlib/Board", {}, false);

ProjectConfig.deviceSpin = "MSPM0L1227";
